{"doctype":"markdown","bookId":"trash","createdAt":1662686751363,"updatedAt":1662689301547,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"title":"","body":"What might be the consequences (positive and/or negative) of a social scientist's emotions or biases showing up in their research?\n\nI think ultimately, the determination on whether or not scientist's emotions or biases showing up in their research is positive or negative thing, depends on who looks at it. In an overall sense, whether or noat you think something is good or bad, depends on your personal beliefs and morals. It's not to say that having these beliefs are good or bad, just that what you believe to be negative or positive is going to be different than what the person next to you thinks. That being said, some of the consequences to be the determination of your research getting shut down possibly by a judge or authority figure not aggreeing with what you are looking to prove, or it could potentialy ruin your name and your credidation. Some of the positives could be leading the world to a more echonoimcally safe culture, a cleaner world, newer technology, or simply better living styles and healthier living styles for humans all together. \n\nApple: Climate Change\nhttps://www.youtube.com/watch?v=ANOgCY6NlGs\nLets take Apple for example. In my ad, they talk about making changes to help make a climate change for the betterment of the world. With Apple, they are constantly looking to innovate technology, at the same time, they are looking to reduce their negative impact on the environment. Now, one of the things they are looking into is the first ever Apple vehicle which will be electric. This would reduce emitions sent into the air as well as the need for gas or oil. A cleaner and more suitable air to breath or ground to walk on. They also have stopped adding additives to their phones. By additives, I mean, Charge block, and recently I dont believe they have headphones in their phone cases. Additionally they are starting to make things more and more out of aluminum or other metals. This reduces the plastic and waste in the world as metals can easily be melted down and reused. The need for a climate change is, in my opinion, pretty drastic, their their use of the baby in the add really made it hit home with me as I like many parents, want to leave my child with a world they can live in freely without worry. I guess the bias would be towards people wanting to make a change for the betterment of the planet. (though if you ask Elon Muske, this world is pretty much doomed which is why he is exploring the ability to colonize another planet).\n\nHaagen-Dazs: Beard Bibs\nhttps://www.adsoftheworld.com/campaigns/beard-bibs\nThis one actually made me laugh a bit. To the point, I would by one. Each of the beards portreys a bit of how men WANT to see themselves. Manly, strong, king of his own kingdom. Trying to think of a bias for this, between the positives and the negatives, I find it a bit of a struggle. I see ecko frendly people disaggreeing with it as it potentially just add to the amount of waste thrown out. I see some, not all, but some women hating it as they feel like they may be with a child. Which could ultimately hurt their significant other's emotional state. But at the same time, the ones that would like it, would be the ones with beards. Having a beard, I see alot of potential in this, if made from ecko friendly sources. \n\nJeep: GroundHog Day - Bill Murray\nhttps://www.adsoftheworld.com/campaigns/groundhog-day-bill-murray#collection-lb-content\nIf you haven't seen Groundhog day yet, are you really living? So, I could see potentially two biases from this commercial. One being his interactions with the people of the town. Constantly blowing them off and shuffling past them. Leaving them in a state of disarray. Additionally, I could see some animal activists really disagreeing with the fact hes carrying around a ground hog like its his child. That being said, the comercial made me laugh still. These biases, though they are present, are almost drowned out by the comedy from his performance. At the same time, can we just agree of how amazing it is that those people are still around todo the commercial?\n\nMini Cooper: Created in a Countryman\nhttps://www.adsoftheworld.com/campaigns/created-in-a-countryman#collection-lb-content\nI have to be honest, this one threw me for a loop. I found it a bit confusing. I think one of the potential biases for this is that they portreyed it with a couple in love, which makes it seem like they are pushing the agenda that it is for couples and not families or single people. Additionally, the whole underwater part really confused me. The official title is Created in a Countryman, but the commercial/ad is underwater sea life? They are trying to represent the idea of the amount of space in the vehicle, yet theres definitely better ways todo it. Ultimately, I think this ad was a flop. \n\nExamine your four advertisements. How are potential biases represented in each of your ads? Think about the biases of the advertiser (creator of the ads) and the target audience (viewers of the ads). If you do not think bias is present, explain why and provide examples from your ads to support your point.\nIn a few sentences, summarize the presence of potential biases in your advertisements.\nPlease include the links to your advertisements in your post so your peers can view them.","tags":[],"_id":"note:22HpFORAH","_rev":"20-20f965fcc3635c58e1c931424006dc1e"}