{"doctype":"markdown","title":"D2-4","body":"\t\nUse the link in the Jupyter Notebook activity to access your Python script. Once you have made your calculations, complete this discussion. The script will output answers to the questions given below. You must attach your Python script output as an HTML file and respond to the questions below.\n\nIn this discussion, you will apply the central limit theorem and use principles of the Normal distribution to calculate probabilities. You will demonstrate two key parts of the central limit theorem:\n\nThe distribution of sample means is approximately Normally distributed (bell-shaped) as the sample size increases and we repeatedly draw these samples, regardless of the shape of the population distribution from which the samples are drawn.\nThe average of all sample means is equal to the population mean. In practice, the average of all sample means will closely approximate the population mean.\nYou will generate a population data set representing total precipitation (TPCP) in tenths of a millimeter using Python's numpy module. The distribution of this data set will be skewed. This data set will be unique to each student, and therefore the answers will be unique as well. Run Step 1 in the Python script to generate your unique population data.\n\nIn your initial post, address the following items:\n\nIn the Python script, you created a histogram for the dataset generated in Step 1. Check to make sure that this data distribution is skewed and included in your attachment. See Step 2 in the Python script.\nWhat is the mean of the TPCP population data? See Step 3 in the Python script.\nIn the Python script, you selected a random sample with replacement, of size 50 (note that this is a sufficiently large sample), from the TPCP population. What is the mean of your random sample? Does this sample mean closely approximate the TPCP population mean? See Step 4 in the Python script.\nYou also selected 1,000 random samples of size 50 and calculated the mean of each sample. Then you stored those means into a dataframe. Check to make sure the output of this step is in your attachment. See Step 5 in the Python script.\nReview the plotted data distribution for these 1,000 means. Does this approximate a Normal distribution? Does this confirm the first part of the central limit theorem? Why or why not? See Step 6 in the Python script.\nWhat is the \"grand\" mean and standard deviation of these 1,000 means? Does the grand mean closely approximate (on a relative basis) the mean of the original distribution? Does this confirm the second part of the central limit theorem? Why or why not? See Step 7 in the Python script.\nRecall that your distribution of 1,000 means is Normally distributed even though the population distribution was skewed and the grand mean closely approximates the population mean. In your follow-up posts to other students, review your peers' results and provide some analysis and interpretation.\n\nIs their population distribution skewed? Is their distribution of 1,000 sample means approximately Normally distributed? Does this confirm the first part of the central limit theorem? Why or why not?\nDoes their grand mean closely approximate their population mean? Does this confirm the second part of the central limit theorem? Why or why not?\nBased on this discussion activity, what have you learned about the central limit theorem?\nRemember to attach your Python output and respond to all questions in your initial and follow-up posts. Be sure to clearly communicate your ideas using appropriate terminology.\n\nTo complete this assignment, review the Discussion Rubric.","bookId":"book:D-IINSM2B","createdAt":1694011842890,"updatedAt":1694011876074,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"tags":[],"_id":"note:3IM9huasE","_rev":"4-0b026cf918d522350fde576e34bc8fdb"}