{"doctype":"markdown","bookId":"trash","createdAt":1666317938099,"updatedAt":1666320803673,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"title":"","body":"## Read The Thorny Ethics of Computer Programming and reflect on the article. Consider this sentence:\n\n> \"What I've discovered over the years is simply if you refuse to build it they'll get someone else to do it, and someone else certainly will.\"\n\n### What would you do if asked to code something you knew was wrong?\n\n  There are a few times in my life when I have been faced with this dilema. Ultimately, what I have taught myself is that I have to disconnect my personal feelings from something. I also am a firm believer in \"dont believe in everything you read\" especially when it comes to the news/media. The article this gentelman read stated the girl commited suicide after taking the drug. What proof do they have to make this accusation? Did they speak to the girl? (its a rhetorical question) Clearly not. What they are basing this on is 1 thing that was recently changed in her every day life, she started taking the meds. did they speak to the girls family? In this type of scenario, the family is always looking for someone else to blame. They would be the last people i would speak to, unless I had an agenda already against the farmecudical company. \n\n\n### As a software developer, what are your ethical responsibilities to the end user and the organization?\n  There are a few times in my life when I have been faced with this dilema. Ultimately, what I have taught myself is that I have to disconnect my personal feelings from something. I also am a firm believer in \"dont believe in everything you read\" especially when it comes to the news/media. The article this gentelman read stated the girl commited suicide after taking the drug. What proof do they have to make this accusation? Did they speak to the girl? (its a rhetorical question) Clearly not. What they are basing this on is 1 thing that was recently changed in her every day life, she started taking the meds. did they speak to the girls family? In this type of scenario, the family is always looking for someone else to blame. They would be the last people i would speak to, unless I had an agenda already against the farmecudical company. \n\nUltimately, I think our responsibilities are to the software. We can get parameters and guidlines from the company or end users but what they do with the software we develop is usually outside of our control unless we put in fail safes. But at the same time, how can you fail safe for something that may occur after your gone? How many software developers are still maintaining their software years down the road? Not many. \n\nI guess the example im going to choose, is one that i feel, goes beyond just the old DOS time keeping systems for billing companies. In this instance it was a legal firm, who theoretically, SHOULD KNOW BETTER. IN this instance they definitely did not. I think its important for programers to put in fail safes that would prevent a company from building up time to bill others with. I singled in on this one because as a contractor who has to submit their time every week, i feel we have an ethical obligation to submit the correct and accurate time. Unfortunately we do not have a start stop button, we just submit our time at the end of the week. \n\n### Give an example from the readings of a standard that supports ethical programming. How does it do so?\n\n> I guess the example im going to choose, is one that i feel, goes beyond just the old DOS time keeping systems for billing companies. In this instance it was a legal firm, who theoretically, SHOULD KNOW BETTER. IN this instance they definitely did not. I think its important for programers to put in fail safes that would prevent a company from building up time to bill others with. I singled in on this one because as a contractor who has to submit their time every week, i feel we have an ethical obligation to submit the correct and accurate time. Unfortunately we do not have a start stop button, we just submit our time at the end of the week. \n> \n>  \n>    Developer Scott Powell also had his own story to share. “I felt a similar twinge of guilt writing some time-tracking software for a legal firm in England, and after demoing it was told that starting a timer should *not* stop any currently running one. (this was single user software, back in DOS days, btw) Being able to bill many clients at a time struck me as being pretty dodgy.”\n\n\n\n\nIn response to your classmates, consider the following:\n\n### What do you find interesting or relatable in your peers' posts?\nDoes anything in a peer's post change your mind or make you think differently about your own approach?\nDo you disagree with anything your peers wrote? Why and what is your counter response?\n","tags":[],"_id":"note:5XmSSkqjI","_rev":"8-1d2293b6e815168baf2611ea3a1f25ea"}