{"doctype":"markdown","bookId":"trash","createdAt":1663605365399,"updatedAt":1663708855011,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"title":"","body":"# CS210 Mod 3 Journal\n\n## What was the most interesting thing you learned over the past three weeks?\n\n> I would say, for the most part, many of the stuff I learned from this class is the same stuff I learned from the clase I took before this one which covered Java. And yet, the same still holds true for this class. I find the most interesting thing to be how the functions opperate in and with eachother. And how easy it is to import functions from other classes. \n\n## How has your perception of a topic changed based on your readings and/or lab work?\n> Initially, I always saw C++ as more of a daunting type of language. The readings and activities so far have definitelya imporoved my outlook on it. To the fact, Much of my robotics programming is writen in c++ and this has definitely helpped in my understanding of whats going on and how to better write/format the code to get the robot to do what i need it to do. \n\n## How did you overcome roadblocks you encountered while going through the activities or project? Were these strategies effective or do you need to change your approach going forward?\n\n> Honestly, I would have to say research. Lots and lots of research. I am what I like to call, a google expert. But, working in IT, you almost have to become a google expert because no one person can know EVERYTHING. Things in IT are constantly changing and evolving. Additionaly, the  the code tester web app that the school as to review your code is extremely useful. As I mainly work on a mac, Running C++ is not exactly the easiest task. So, being able to utilize web applications that can run and compile code makes it much easier to test a simple function. Additionally, Online editors like https://www.programiz.com/cpp-programming/online-compiler/ allowed me to run the entire code and be able to review the output. \n\n","tags":[],"_id":"note:8zHTR3uKp","_rev":"23-bfcbdfa03432ff50b2d80087489822e3"}