{"doctype":"markdown","title":"Wings Migration","body":"## IP's & DNS\n\nthinclient is installed on avd platform\n\nwill need portal\n\nopen request from gdc to allow IP's\n\n## Updates / New Install:\n\n1. For an existing installation, find your C:\\Wings folder using Windows Explorer and delete all of its contents. For a new installation, create a C:\\Wings folder (on your install location - local machine, Citrix box, network drive - whichever applies). C:\\Wings is the recommended folder name, although it can be whatever you wish. If you do change it, you will need to remember it for future software upgrades.\n2. Download the Wings Client installation file: Stat-02-StatClient-V2023-4-0.exe. Save it to your C:\\Wings folder. (Don't run it.)\n3. Once the download is complete, navigate to your C:\\Wings folder and double-click on the .exe file. (You may need to show file extensions in your Explorer view.)\n4. Accept the license agreement, and verify the Destination Folder to be your C:\\Wings folder.\n5. Select Extract to extract all of the files. The dialog will close when the extraction is complete.\n6. (Note: You don't need to do this if you already have a shortcut created for this file.) Find the **C:\\Wings\\WingsClient** folder (created by the install), and locate the **_WingsClient.exe_** file. Right-click on it and select Send to Desktop. This will put a shortcut on your desktop with an icon that is a \"V\" with feathers. Use this shortcut to run Wings.\n7. For verification purposes, use the following:\n8. Stat Reporting Client Version (via Help > About in the application) match against Stat Portal > Installation Files > Software Downloads.\n\nTest Login:  \n**User Name:** sovostat2.1  \n**Password (case-sensitive):** sovos\n\n\n# <span style='color:orange'>***STEPS***</span>\n\non wings app server, stop service before copying database\n\nlog into db servers, launch ***SSMS***, right click db and select backup\n\ntransfer over via sftp\n\n","bookId":"book:fbq8FxpkL","createdAt":1694441121459,"updatedAt":1694527482476,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"tags":[],"_id":"note:IbF-Fg3V-","_rev":"14-86aa1d42df1342dfd63cdcf3d8748ff5"}