{"doctype":"markdown","bookId":"book:2pLIiVrD5","createdAt":1694028785307,"updatedAt":1694028800532,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"title":"2-4","body":"In the Python script, you created a histogram for the dataset generated in Step 1. Check to make sure that this data distribution is skewed and included in your attachment. See Step 2 in the Python script.\n\nAs you can See from the picture above, the Bar chart appears to be skewed to the left meaning that the skew for the data is a negative skew.\n\nWhat is the mean of the TPCP population data? See Step 3 in the Python script.\n\nIn step 3, it was determined that the mean for the data that was generated in my notebook was: Population mean = 475.42.&nbsp;When comparing this number to the bar chart, this value appears to correlate with the the visual representation for the data as the mass chunk of the data appear to be just under the 500 mark but also after the 0 mark.\n\nIn the Python script, you selected a random sample with replacement, of size 50 (note that this is a sufficiently large sample), from the TPCP population. What is the mean of your random sample? Does this sample mean closely approximate the TPCP population mean? See Step 4 in the Python script.\n\nIn my data, the sample mean was Sample mean = 452.24. In retrospect, for the small amount of data provided, this is only approximately 20 points away from the population mean. When comparing the sample mean to the bar chart, the fact that when taking a random sample would generate a mean within this proximity makes sense as the this is where the majority of the points fall.\n\n\n\nYou also selected 1,000 random samples of size 50 and calculated the mean of each sample. Then you stored those means into a dataframe. Check to make sure the output of this step is in your attachment. See Step 5 in the Python script.\n\nAs you can see below, The 100 samples are present.&nbsp;\nDataframe of 1000 sample means\n\n      means\n0    479.02\n1    531.18\n2    516.52\n3    467.10\n4    454.86\n..      ...\n995  457.74\n996  508.82\n997  567.24\n998  494.78\n999  436.58\n\n[1000 rows x 1 columns]\n\nReview the plotted data distribution for these 1,000 means. Does this approximate a Normal distribution? Does this confirm the first part of the central limit theorem? Why or why not? See Step 6 in the Python script.\n\nBased on the data given, the bar chart generated is below:\n\n\nWhen comparing this to the plotted data from the overall data set, the plotted data points of the mean samples appear to approximate a more Normal distribution than the original data. This is backed but the fact that the mean data when plotted has more of a bell shape than the original data. Additionally this appears to have a more positive screw than the original data did as the points of the means appear to be plotted further right than the means of the original data.&nbsp;\n\n\nWhat is the \"grand\" mean and standard deviation of these 1,000 means? Does the grand mean closely approximate (on a relative basis) the mean of the original distribution? Does this confirm the second part of the central limit theorem? Why or why not? See Step 7 in the Python script.\n\nGrand Mean (Mean of 1000 sample means) = 477.19\nStd Deviation of 1000 sample means = 44.01\nProbability that a specific mean is 450 or less = 0.2684\n\nThe Grand Mean falls within 2 places of the original mean. This means that the mean of the sample means, is approximately the same as the mean for the original set of data. I believe this would be a fairly good example for the Central Limit Theorem as the theorem states that&nbsp;their(means) variances will be approximately equal to the variance population as the size of the data starts to grow.&nbsp;\n\n","tags":[],"_id":"note:Inc9Xc5P4","_rev":"3-45b019e57762a4e7157128df8614ac8c"}