{"doctype":"markdown","title":"My Impact!","body":"### 1.1 Stable and Secure Operations\n\n> Status: On Track\n\n### what:\n\n> 1. Get involved in daily operations (Cherwell tickets, Orion monitoring, etc) and are addressed in an appropriate time-line, reducing overall backlog\n> 2. Learn the PRE environment (get familiar with applications, various teams, etc).\n> 3. Prepare for on-call activities/rotations.\n> 4. Getting involved with AvD as part of core team and providing support for US hours.\n> 5. Proper testing of solutions before Implementing approved changes, keeping related unplanned severe incidents to a minimum.\n> 6. Provide operational improvements while maintaining living documents for the delivery of optimal support for the landscape of on-premise and hybrid cloud services provided by Operations.\n> 7. Contribution for the preparation and execution of the annual Disaster Recovery test for Azure Production Applications and the US and Toronto Data.\n> 8. Adhere to and comply with all audit, security and regulatory compliance (Security Controls).\n\n### Employee Comments:\n\n> Since my time starting here, I have learned that we have a vast amount of Applications. Since starting, I have and continue to work to learn as much as I can about them. I have also learned that we have Multiple Monitoring solutions in place (Orion, Azure, Cherwell, ext). To better help me understand what we are monitoring, as well as to help understand the applications a bit more, I have been assisting with as much Solarwinds projects as I can. One in particular is the Application Monitoring project that Kalpesh, Jesus and myself are working on with Sylvain and his team. We are working to build a more in-depth level of monitoring for their applications and application pools to which has helped me learn more and more about Orion Solarwinds. My goal is to become a secondary to kal in the event he is out of office, or needs a break. Additionally, I am and will be continuing to take more and more Linux based tickets to assist Johan in the administration of our linux environment.\n\n> To help myself get involved more with the AvD team, Myself, as well as Johan and Aleks attended the AvD meetings when they had them so that we could address any tickets that we have gotten. Additionally I worked with Bachir and his team to assist in the Windows 11 AvD roll out. One of the key things we assisted with was to install the applications and build the \"Pre-PreProd Golden Images\" for the AvD environments. Since this project has ended though, Bachir and Geraldine continuously cancel the meetings so we have not been able to go further. I have however started to pick up more and more AvD tickets which I am attaching to this.\n\n> Unfortunately, i have had a few instances where i know i can improve as well. like the fact that i complete the tasks, and forget to close the tickets. Which I have taken it upon myself to generate a \"data science\" style overlook of this for you.\n> ![clipboard.png](inkdrop://file:-Zy7uSfzq)  \n> To help you understand this date, the first two are fairly self explanatory. My Average Amount of days is higher than i would like it but this is due to a few outliers that i will provide later. The main take from this is that the Median ticket or middle range is still lower meaning the majority of my tickets are on the shorter close side. To better visualize this, I created this:\n> ![clipboard.png](inkdrop://file:AjlDefDt3)  \n> The Outliers from this are what is driving my mean closing time up which i will list below. The reason for these is typically due to forgetting to close the ticket or simply waiting on a user to get back to us. Mind you this data is from 2022 as well as 2023 so that you can see the improvement. The Improvement can be demonstrated by ![clipboard.png](inkdrop://file:zA27GcqzE)  \n> the older the tickets are, the earlier in my time here. as the majority of them are from around the lower end of the spectrum. I believe this data proves that i have assisted in daily operations and keeping PartnerRE going.\n\nI have also had the pri\n\n> I have assisted in a few projects while I have been here thus far. One of the major ones being the migration to Azure. I worked diligently with Mark Allen on getting the Z-Scaler server migrated over to Azure via means that neither of us had previously encountered (using an image downloaded from Zscaler).\n","bookId":"book:LP2seisLU","createdAt":1694453158513,"updatedAt":1694525681504,"status":"none","share":"private","numOfTasks":0,"numOfCheckedTasks":0,"tags":[],"_id":"note:J2ZUeDa7l","_rev":"19-5e7e62a9774b7faa72ae966d379f5b47"}